app/Models/KelasInputModel.php

    public function tampilkan_data(){
        //SELECT * FROM 'kelas'
        return $this
        ->db
        ->table($this->table)
        ->orderBy('NRP', 'ASC')
        ->get()
        ->getResult();
---
SELECT *
FROM `kelas`
ORDER BY `NRP` ASC

    public function tambah_data($data){
        return $this->insert($data);
---
INSERT INTO `kelas` (`NRP`, `Nama`, `Nilai`) VALUES ('C14220048', 'Nathanael Jessen', '1234')

    public function check_login($nrp, $password){
        return $this
                ->where('NRP', $nrp)
                ->where('Nilai', $password)
                ->first();
---
SELECT *
FROM `kelas`
WHERE `NRP` = 'C14220002'
AND `Nilai` = '1234'
 LIMIT 1